000100990120
001700190401
001701190401         Dcl-Pr DayOfWeek ZONED(1) ;
001702190401           WorkDate  Date;
001703190401         End-Pr;
001705190401
001706190401         Dcl-Pr DayName Char(9);
001707190401           DateIn Date;
001708190401         End-Pr;
001709190401
002202190401         Dcl-Pr DateWords Char(28);
002203190401           WorkDate  Date;
002204190401         End-Pr;
002205200808
