000100200809         DCL-F AMERICANLG USAGE(*INPUT) KEYED RENAME(AMERICANLG:AMERICANR);
000101200809
000103200809         DCL-F TEAMDSP WORKSTN;
000104200810
000109200809         DCL-PI MAIN EXTPGM('BLUEJAY');
000110200809           // ?????
000111200809         END-PI;
000112200809
000113200809         EXFMT BLUEJAYDSP;
000114200810           READ TEAM3;
000115200810
000116200809           DOW NOT(*IN03);
000117200809              DayName = DayNumName(DayIn);
000118200809              *in99 = *on;
000119200809               WRITE INPUT;
000120200809               EXFMT OUTPUT;
000121200809              *in99 = *off;
000122200809               IF *IN03 = '0';
000123200809                 DayIn = 0;
000124200809                 EXFMT INPUT ;
000125200809               ENDIF;
000126200809            ENDDO;
000127200809            *INLR = *ON;
000128200809            RETURN;
